Revit 2024 API
ApplicationInitializedEventArgs Class
 The event arguments used by the ApplicationLaunched event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class ApplicationInitializedEventArgs : RevitAPISingleEventArgs
Visual Basic
Public Class ApplicationInitializedEventArgs _
	Inherits RevitAPISingleEventArgs
Visual C++
public ref class ApplicationInitializedEventArgs : public RevitAPISingleEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.ApplicationInitializedEventArgs
See Also
ApplicationInitializedEventArgs Members
Autodesk.Revit.DB.Events Namespace